## ------------------------------------------------------------
## list 타입 전용 메서드
## ------------------------------------------------------------
## 원소/요소 확장 => extend()
## ------------------------------------------------------------
## extend(원소)  : 원소/요소 합쳐서 새로운 리스트 확장
## ------------------------------------------------------------
nums=[11, 22, 33]

nums.extend([9, 8, 7])
print(f'확장 후 {nums}')

nums.extend([9, 8, 7])
print(f'확장 후 {nums}')

print(f'덧셈 진행 {nums+["A", "B"]}')  # 보여주기만, None X
print(f'덧셈 후 {nums}')

## ------------------------------------------------------------
## 원소/요소 삭제 관련 메서드 : remove(), pop(), clear()
## ------------------------------------------------------------
## remove(데이터) : 제일 먼저 찾은 해당 데이터 원소/요소 삭제
## ------------------------------------------------------------
nums.remove(9)
print(f'remove(9) 후 {nums}')

# -> 없으면 ERROR 발생
# nums.remove(100)
# print(f'remove(100) {nums}')

## ------------------------------------------------------------
## pop()/(idx) : 제일 마지막 원소 꺼내기/인덱스 원소 꺼내기
##               꺼냈기 때문에 리스트에 해당 원소 없음!!
## ------------------------------------------------------------
print( nums.pop() )
print( nums.pop() )
print(f'pop() 후 => {nums}')

print( nums.pop(2) )
print(f'pop(2) 후 => {nums}')

## ------------------------------------------------------------
## clear(idx) : 모든 원소/요소 삭제로 빈 리스트 만듦
## ------------------------------------------------------------
nums.clear()
print(f'clera() 후 => {nums}')
