## ----------------------------------------------------------------------
## while 반복문 : 주로 반복 횟수가 미정인 경우 사용
##               물론 반복 횟수 정해진 경우도 사용은 가능
## ----------------------------------------------------------------------
## [1] list의 원소를 하나씩 출력하기. 단, while 반복문 사용
nums = [11,22,33,44,55]

## ----------------------------------------------------------------------
for n in nums:
    print(n)

## ----------------------------------------------------------------------
idx=0                       ## 시작인덱스
limit=len(nums)             ## 종료값/반복중단값
while idx<limit:            ## 0<5  1<5  2<5  3<5  4<5  5<5
    print(nums[idx])
    idx = idx + 1           ## idx값 갱신

print("END~")