## ------------------------------------------------------------------
## 조건문 - 다중 조건문 / 다중 if문 
## ------------------------------------------------------------------
## 형식 : if 조건코드 :   <== 조건코드 결과 True/False
##        <---->실행코드
##        <---->실행코드
##        elif 조건코드2:
##        <---->실행코드
##        <---->실행코드
##        elif 조건코드3:
##        <---->실행코드
##        <---->실행코드
##        else:             <= 선택. 반드시 X
##        <---->실행코드
## ------------------------------------------------------------------
## 점수에 대한 학점 --------------------------------------------------
## -> A : 90점 이상
## -> B : 80점 이상
## -> C : 70점 이상
## -> D : 60점 이상
## -> F : 나머지
jumsu = int(input("점수 입력:").strip())

## => 다중 조건문
# if jumsu>=90:     # 89>=90
#     print(f"{jumsu} - A학점.")  #해당 실행하고 34라인으로
# elif jumsu>=80:   # 89>=90 True면
#     print(f"{jumsu} - B학점.")  #해당 실행하고 34라인으로
# elif jumsu>=70:
#     print(f"{jumsu} - C학점.")  #해당 실행하고 34라인으로
# elif jumsu>=60:
#     print(f"{jumsu} - D학점.")  #해당 실행하고 34라인으로
# else:
#     print(f"{jumsu} - F학점.")  #해당 실행하고 34라인으로

## => 조건문 여러개
if jumsu>=90:
    print(f"{jumsu} - A학점.")

if jumsu>=80: 
    print(f"{jumsu} - B학점.")

if jumsu>=70:
    print(f"{jumsu} - C학점.")

if jumsu>=60:
    print(f"{jumsu} - D학점.")

if jumsu<60:
    print(f"{jumsu} - F학점.")
