# ------------------------------------------------------
# 숫자 표기법 : 2진수, 8진수, 16진수 변환
# ------------------------------------------------------
# 진수 변환 내장함수 => bin(), oct(), hex(), int()
# ------------------------------------------------------
noDec = 2025     # 10진수
noBin = '0b111'  # 2진수는 문자열로
noOct = '0o7'    # 8진수
nohex = '0x15'   # 16진수

## 10진수 => 다른 진수로 변환
print(f'{noDec}  2진수 변환 : { bin(noDec)}')
print(f'{noDec}  8진수 변환 : { oct(noDec)}')
print(f'{noDec} 16진수 변환 : { hex(noDec)}')

## 2진수/8진수/16진수 => 10진수로 변환
print(f'{noBin}  10진수 변환 : { int(noBin, base=0)}') # 10진수가 아니라 오류 => base를 줘야함
print(f'{noBin}  10진수 변환 : { int(noBin, base=2)}')
print(f'{noOct}  10진수 변환 : { int(noOct, base=8)}')
print(f'{nohex}  10진수 변환 : { int(nohex, base=16)}')