## --------------------------------------------------------
## 사용자 정의 함수 : 개발자가 필요에 의해서 만드는 함수
## --------------------------------------------------------
## --------------------------------------------------------
## 함수기능 : 2개 정수 덧셈 수행
## 함수이름 : plus_two_num [파이썬] / plusTwoNum [일반]
## 매개변수 : num1, num2
## 반환결과 : 덧셈 결과값
## --------------------------------------------------------
def plus_two_num(num1, num2):
    result = num1 + num2
    return result

## --------------------------------------------------------
## 함수기능 : 3개 정수 덧셈 수행
## 함수이름 : plus_three_num [파이썬] / plusThreeNum [일반]
## 매개변수 : num1, num2, num3
## 반환결과 : 덧셈 결과값
## --------------------------------------------------------
def plus_three_num(num1, num2, num3):
    result = num1 + num2 + num3
    return result

## --------------------------------------------------------
## 함수기능 : 6개 정수 덧셈 수행
## 함수이름 : plus_six_num [파이썬] / plusSixNum [일반]
## 매개변수 : num1, num2, num3, num4, num5, num6
## 반환결과 : 덧셈 결과값
## --------------------------------------------------------
def plus_six_num(num1, num2, num3, num4, num5, num6):
    result = num1 + num2 + num3 + num4 + num5 + num6
    return result


## --------------------------------------------------------
## 어떻게 하면 매개변수 개수 변화에 대응하는 한 개의 함수?
## --------------------------------------------------------
