## ----------------------------------------------------------------
## Dict 자료형 살펴보기
## - 컨테이너 타입 중 맵핑 타입 => Key:Value
## - 형식 : {Key1:Value1, Key2:Value2, ...}
## - 특징 : Key로 Value를 찾음! 인덱스 필요 없음!!!
## ----------------------------------------------------------------
## dict 객체 생성
## ----------------------------------------------------------------
d1 = {}
d2 = {'name':'홍길동', 'age':10}
d3 = {'jumsu':[90, 99, 100], 'rank':10}
d4 = {'jumsu':{'국어':90, '수학':89, '미술':100}, 'score':(90, 100)}

## => Key : 변경(수정/삭제)X => list 불가!
d5 = {('유진', '남'):90, ('유진', '여'):90}

print(f"d1 => {type(d1)}, {len(d1)}개, {d1}")
print(f"d2 => {type(d2)}, {len(d2)}개, {d2}")
print(f"d3 => {type(d3)}, {len(d3)}개, {d3}")
print(f"d4 => {type(d4)}, {len(d4)}개, {d4}")
print(f"d5 => {type(d5)}, {len(d5)}개, {d5}")

## ----------------------------------------------------------------
## dict 원소/요소 읽기 => 객체변수명[ Key ]
## ----------------------------------------------------------------
## [d2의 age 값 읽기]
print(f"age => {d2['age']}")

## [d3의 jumsu 값 읽기]
print(f"jumsu => {d3['jumsu']}")

## [d5의 (유진, 여) 값 읽기]
print(f"(유진, 여) => {d5[('유진', '여')]}")
# print(f"(유진) => {d5[('유진')]}")  ## keyError 일부분만 사용 안 됨!