## ----------------------------------------------------------------------------
## Dict 자료형 - 전용 메서드(Method)
## ----------------------------------------------------------------------------
## 요소/원소 추가 메서드 : update()
## ----------------------------------------------------------------------------
jumDict = {'과목1':98, '과목2':99, '과목3':100, '과목4':78, '과목5':88}
infoDict = {'이름':'홍길동', '학년':1, '반':5}

## => 추가
jumDict.update({'과목6':100})

## => 업데이트
jumDict.update({'과목6':80, '등수':3})
print(f"jumDict => {jumDict}")

## => 추가
jumDict.update(infoDict)
print(f"jumDict => {jumDict}")


## => 추가 : update(key1=value, key2=value, ... )
##    주의!! Key는 str타입만 가능! str타입이지만 '',"" X
##    내부에서 Key1:value로 변환해서 저장함
jumDict.update(국적='대한민국', 전화='010-1111-2222')
print(f"jumDict => {jumDict}")
