# -----------------------------------------------------------
# 변수 선언 및 사용법
# -> python에서는 모든 변수가 데이터의 주소를 저장함!
# -----------------------------------------------------------
# 선언 형식 : 변수명 = 데이터 
# 숫자 데이터 => 변수명 = 데이터
age   = 28
avg   = 99.8888
score = .9  # 0.9 으로 0은 생략됨
score = 8.  # 8.0 으로 0은 생략됨

# 글자 데이터 => 변수명 = '데이터' 또는 변수명 = "데이터"
#               변수명 = '''데이터''' 또는 변수명 = """데이터"""
name = '서승빈'
name = "마징가"
name = '''태권V'''
msg = '오늘은' \
'좋은날'

# 긴 문장의 경우 '오늘은 엔터입력'
# 또는     msg = ''' 오늘은
#                    좋은날 ''' 이렇게도 가능
