## --------------------------------------------------------------------
## while
## --------------------------------------------------------------------
## [요청] 3단 출력하기
num = 1
while num < 10:
    print(f"3 * {num} = {3 * num}")
    num += 1

## [요청] 2단 ~ 9단 출력하기
# num = 1                   ## while 안에 찍어줘
dan = 2
while dan < 10:
    print(f"{dan:-^10}")
    num = 1                 ## 초기화 안 해주면 2단 찍고 멈춤
    while num < 10:
        print(f"{dan} * {num} = {dan * num:02}")
        num += 1
    dan += 1