## -----------------------------------------------------------------------
## 컨테이너 자료형 : 여러 개의 데이터를 저장할 수 있는 자료형
## -> 그 중에 순서있는 자료형 : 시퀀스(Sequence) 자료형
## -----------------------------------------------------------------------
## [4] List 자료형과 연산자
## -----------------------------------------------------------------------
data1 = [11, 22, 33, 44, 55]
data2 = ['a', 'b', 'c']

## 산술연산자 => 덧셈 : list + list => 원소 합쳐진 list
print(f'{data1} + {data2} = {data1 + data2}')

# 기본타입 => 컨테이너타입 형변환 안됨! ERROR
# print(f'{data1} + 100 = {data1 + list(100)}')
# print(f'{data1} + 100.4 = {data1 + list(100.4)}')
# print(f'{data1} + False = {data1 + list(False)}')

# str타입 => 원소/요소를 가지는 컨테이너 타입
print(f'{data1} + list("Happy") = {data1 + list("Happy")}')

## 산술연산자 => 곱셈 : list * int => int숫자만큼 원소반복
print(f'{data1} * 3 = {data1 * 3}')

## -----------------------------------------------------------------------



## -----------------------------------------------------------------------
## 멤버연산자 => 원소/요소가 맞는가 검사 in / not in
## -----------------------------------------------------------------------
dataList=[11, 44, "apple", "summer", False]

##=> 11 데이터가 멤버인지 검사
print(f'11 in dataList => {11 in dataList}')
print(f'apple in dataList => {"apple" in dataList}')
print(f'Apple in dataList => {"Apple" in dataList}')