## -------------------------------------------------------------------
## str 전용 메서드 
## -------------------------------------------------------------------
## 문자열에서 특정 원소/요소 인덱스 찾는 메서드 : find()/index()
## -------------------------------------------------------------------
## find()  : 없는 요소의 경우 -1 돌려줌
## index() : 없는 요소의 경우 ERROR
## -------------------------------------------------------------------
data = "Good Good Good"
##      01234567890123
## [1] 2번째 'G' 인덱스 출력하기
print(f'1번째 G: {data.find("G")}')
print(f'2번째 G: {data.find("G", 1)}')

# 첫 번째 발견된 'G' 인덱스
g_idx = data.find('G')

# 두 번째 발견된 'G' 인덱스
g_idx = data.find('G', g_idx+1)

# 세 번째 발견된 'G' 인덱스
g_idx = data.find('G', g_idx+1)

## -------------------------------------------------------------------
## rfind()  : 없는 요소의 경우 -1 돌려줌. 양수인덱스만 돌려줌
## rindex() : 없는 요소의 경우 ERROR. 양수인덱스만 돌려줌
## => str의 끝부분부터 찾기 시작함
## -------------------------------------------------------------------
print('마지막 G :', data.rfind('G'))


## -------------------------------------------------------------------
## count()  : 지정된 원소가 str 안에 몇 개/번 있는지 반환
## -------------------------------------------------------------------
print(f"G의 개수는 ? {data.count('G')}")
print(f"G의 개수는 ? {data.count('g')}")
print(f"G의 개수는 ? {data.count('Go')}, {data.count('d')}")

## -------------------------------------------------------------------
##     strip() : str의 앞부분과 끝부분의 공백을 제거해주는 메서드
## => lstrip() : 앞부분 공백 제거
## => rstrip() : 끝부분 공백 제거
## -------------------------------------------------------------------
data = "   오늘은 좋은 날!  "

data1 = data.strip()
data2 = data.lstrip()
data3 = data.rstrip()

print(f"{data}  : {len(data)}개")
print(f"{data1} : {len(data1)}개")
print(f"{data2} : {len(data2)}개")
print(f"{data3} : {len(data3)}개")

## -------------------------------------------------------------------
##     strip(문자) : str의 앞부분과 끝부분의 지정 문자를 제거해주는 메서드
## => lstrip(문자) : 앞부분 지정 문자 제거
## => rstrip(문자) : 끝부분 지정 문자 제거
## -------------------------------------------------------------------
data='Good! Good Luck!!'
print(f"{data} :{data.strip('!')}")
print(f"{data} :{data.strip('Go')}") ## 체크