## ---------------------------------------------------------------
## 매개변수/파라미터/parameter : 함수 기능 수행에 필요한 데이터
##
## - 종류 : 일반매개변수       예:  value     <= 데이터 미전달 ERROR
##          가변인자매개변수       *value
##          키워드매개변수        **value
##          디폴트매개변수          value=기본값
## ---------------------------------------------------------------


## ---------------------------------------------------------------
## 함수기능 : 회원가입 후 가입 메시지 출력
## 함수이름 : join
## 매개변수 : id, pw, email
##           gender, loc
##           **options
## 반환결과 : 없음
## ---------------------------------------------------------------
def join(id, pw, email, gender='남', loc='한국', **options):
    pass

## ---------------------------------------------------------------
## 함수 호출
## ---------------------------------------------------------------
#print(join('AAA', 'A123'))          ## 필수 전달 email 없어서 ERROR
print(join('AAA', 'A123', 'A123@gmail.com'))
print(join('AAA', 'A123', 'A123@gmail.com', 취미1='등산', 취미2='게임'))