## ----------------------------------------------------------
## 사용자 정의 함수 : 매개변수 개수 변화에 대응하는 한 개의 함수
##                   가변인자함수
## - 형식 : def 함수명(*변수명)
## - 의미 : value가 0개 ~ N개 전달
## ----------------------------------------------------------
## ----------------------------------------------------------
## 함수기능 : 0 ~ N개 정수 덧셈 수행
## 함수이름 : plus_nums
## 매개변수 : num1, num2, ... numN : 몇 개가 필요한지 X
##           *nums 0개 ~ N개 매개변수
## 반환결과 : 덧셈 결과값
## ----------------------------------------------------------
def plus_nums(*nums):
    # int, float 아니면 계산불가
    for n in nums:
        if type(n) not in [int, float]:
            return "str은 연산 불가"
    
    # 연산결과 반환
    return sum(nums)


## ----------------------------------------------------------
## 함수 호출
## ----------------------------------------------------------
print("plus_nums() =>", plus_nums())
print("plus_nums(True, False) =>",plus_nums(True, False))
print("plus_nums(1,2,3,4,5,6,7,8,9,0) =>",plus_nums(1,2,3,4,5,6,7,8,9,0))
